src/Documents/Приказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Приказ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ректор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПринимаемыеНаРаботу</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТрудовойДоговор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ТрудовойДоговор</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/Приказ/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Приказ.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Приказ.Дата КАК Дата,
	|	Приказ.Номер КАК Номер,
	|	Приказ.Ректор КАК Ректор,
	|	Приказ.ПринимаемыеНаРаботу.(
	|		НомерСтроки КАК НомерСтроки,
	|		Сотрудник КАК Сотрудник,
	|		Сотрудник.Код КАК ТабельныйНомер,
	|		Сотрудник.Должность.Кафедра.Наименование КАК Кафедра,
	|		Сотрудник.Должность.Наименование КАК Должность,
	|		Сотрудник.Должность.Оклад КАК Оклад,
	|		Сотрудник.Должность.ДоляСтавки КАК ДоляСтавки,
	|		Сотрудник.ТрудовойДоговор.Номер КАК ТрудовойДоговор,
	|		Сотрудник.ТрудовойДоговор.НачалоСрока КАК НачалоСрока,
	|		Сотрудник.ТрудовойДоговор.ОкончаниеСрока КАК ОкончаниеСрока
	|	) КАК ПринимаемыеНаРаботу
	|ИЗ
	|	Документ.Приказ КАК Приказ
	|ГДЕ
	|	Приказ.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьКолонтитул = Макет.ПолучитьОбласть("Колонтитул");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПринимаемыеНаРаботуШапка = Макет.ПолучитьОбласть("ПринимаемыеНаРаботуШапка");
	ОбластьПринимаемыеНаРаботу = Макет.ПолучитьОбласть("ПринимаемыеНаРаботу");
	ОбластьМестоДляПодписи = Макет.ПолучитьОбласть("МестоДляПодписи");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьКолонтитул);
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ТабДок.Вывести(ОбластьПринимаемыеНаРаботуШапка);
		ВыборкаПринимаемыеНаРаботу = Выборка.ПринимаемыеНаРаботу.Выбрать();
		Пока ВыборкаПринимаемыеНаРаботу.Следующий() Цикл
			ОбластьПринимаемыеНаРаботу.Параметры.Заполнить(ВыборкаПринимаемыеНаРаботу);
			ТабДок.Вывести(ОбластьПринимаемыеНаРаботу, ВыборкаПринимаемыеНаРаботу.Уровень());
		КонецЦикла;

		ОбластьМестоДляПодписи.Параметры.Заполнить(Выборка);	
		ТабДок.Вывести(ОбластьМестоДляПодписи);
				
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
		//}}
КонецПроцедуры
